{"id":7329,"date":"2019-12-28T08:00:22","date_gmt":"2019-12-28T08:00:22","guid":{"rendered":"http:\/\/drmmunlimited.co.uk\/wp\/?p=7329"},"modified":"2020-09-23T16:27:35","modified_gmt":"2020-09-23T16:27:35","slug":"sadie-morgan-receives-obe-for-services-to-design-advocacy","status":"publish","type":"post","link":"https:\/\/drmmstudio.com\/sadie-morgan-receives-obe-for-services-to-design-advocacy\/","title":{"rendered":"Sadie Morgan to receive OBE for Services to Design Advocacy"},"content":{"rendered":"\r\n<figure class=\"wp-block-image is-resized\"><img loading=\"lazy\" class=\"wp-image-7333\" src=\"http:\/\/drmmunlimited.co.uk\/wp\/wp-content\/uploads\/2019\/12\/SadieMorgan2018_01_ByCGuiout_cdRMM_LANDSCAPE-1024x683.jpg\" alt=\"\" width=\"592\" height=\"395\" \/><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n<blockquote class=\"wp-block-quote\">\r\n<p><strong><em>“Having dedicated my career to promoting design integration within UK projects at every scale, this recognition validates and gives tangible credence to the value I believe great design can bring to a country. I am beyond honoured.” <\/em><\/strong><\/p>\r\n<cite>Prof Sadie Morgan MA(RCA), FRIBA, OBE<\/cite><\/blockquote>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n<p>dRMM Co-Founding Director Sadie Morgan has received an OBE for services to design advocacy in the New Year Honours List, released today. Sadie has championed socially useful architecture as part of her dRMM directorship for over two decades. She has since also held roles at the highest level within national architectural education (President of the Architectural Association; Professor of Professional Practice, University of Westminster); the UK transport and infrastructure (Design Chair, High Speed Two; Commissioner, National Infrastructure Commission); the UK housing sector (Board Member, Homes England); as well as within the realm of place-making and community development (Mayor’s Design Advocate, Greater London Authority; Non-Executive Director, U+I; Non-Executive Director, Major Projects Association; Founder, Quality of Life Foundation).<\/p>\r\n\r\n\r\n\r\n<p>Throughout all her roles, Sadie makes a passionate case for an alternative human perspective to balance economic arguments. Her strength in combining the pragmatic needs of complex projects with the everyday needs of the communities and places has characterised her impact on the wider design industry.<\/p>\r\n\r\n\r\n\r\n<p>Sadie’s dRMM leadership alongside Alex de Rijke, Philip Marsh and Jonas Lencer has been recognised for the creation of architecture that is innovative, high-quality and socially useful – once again bound by an aspiration to make people’s lives better. As a practice, dRMM has promoted sustainable materials and construction since its inception, advocating for stronger collaboration between designers and manufacturers, as well as for the use of engineered timber as a material with exemplary sustainability credentials. dRMM’s award-winning work is often the focus of Sadie’s extensive lecturing both nationally and internationally. She also consistently discusses the role of architects in society and the importance of infrastructure that connects to people and places.<\/p>\r\n\r\n\r\n\r\n<p>Sadie sits on competition jury and advisory panels including the RIBA National Awards Advisory Panel and represents the profession in the media through radio, TV appearances, articles and columns. In 2017, she was named ‘New Londoner of the Year’ at the New London Awards for her work in “championing the importance of design at the highest political level”. In 2019, she won the inaugural ‘Female Architectural Leader of the Year’ at the BD Architect of the Year awards and the ‘AJ100 Contribution to the Profession’ award, voted for by the members of the AJ100 list. Sadie was recently awarded a RIBA Honorary Fellowship for her contribution to the advancement of architecture, sustainable communities and the education of future generations.<\/p>\r\n\r\n\r\n\r\n<blockquote class=\"wp-block-quote\">\r\n<p><em>“My career has been defined by collaboration – I am grateful to my fellow directors, colleagues, and team for their collective spirit, talent, and shared desire to elevate the importance of design. I am also thankful for the support I receive from my family and friends, who have constantly reinforced my drive to promote gender diversity at every level within this great industry<\/em>.<em>”<\/em><\/p>\r\n<cite>Prof Sadie Morgan MA(RCA), FRIBA, OBE<\/cite><\/blockquote>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; “Having dedicated my career to promoting design integration within UK projects at every scale, this recognition validates and gives tangible credence to the value I believe great design can bring to a country. I am beyond honoured.” Prof Sadie Morgan MA(RCA), FRIBA, OBE &nbsp; dRMM Co-Founding Director Sadie Morgan has received an OBE for [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/posts\/7329"}],"collection":[{"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/comments?post=7329"}],"version-history":[{"count":2,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/posts\/7329\/revisions"}],"predecessor-version":[{"id":7840,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/posts\/7329\/revisions\/7840"}],"wp:attachment":[{"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/media?parent=7329"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/categories?post=7329"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/tags?post=7329"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}