{"id":7448,"date":"2020-02-07T14:18:59","date_gmt":"2020-02-07T14:18:59","guid":{"rendered":"http:\/\/drmmunlimited.co.uk\/wp\/?p=7448"},"modified":"2020-09-23T16:23:16","modified_gmt":"2020-09-23T16:23:16","slug":"have-you-issued-your-response-to-the-part-l-f-consultation","status":"publish","type":"post","link":"https:\/\/drmmstudio.com\/have-you-issued-your-response-to-the-part-l-f-consultation\/","title":{"rendered":"Have you issued your response to the Part L &#038; F consultation?"},"content":{"rendered":"\r\n<ul class=\"wp-block-gallery columns-1 is-cropped\">\r\n<li class=\"blocks-gallery-item\">\r\n<figure><img class=\"wp-image-7451\" src=\"http:\/\/drmmunlimited.co.uk\/wp\/wp-content\/uploads\/2020\/02\/PartLResponse-dRMM.jpg\" alt=\"\" data-id=\"7451\" data-link=\"http:\/\/drmmunlimited.co.uk\/wp\/?attachment_id=7451\" \/><\/figure>\r\n<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p><strong>At dRMM, we have issued our response to the Part L &amp; F consultation because we believe that the government’s proposals are a step backwards from the direction in which we urgently must head to meet our climate change targets. <\/strong><\/p>\r\n\r\n\r\n\r\n<p>In 2019, dRMM declared a Climate and Biodiversity Emergency, alongside all 17 Royal Institute of British Architects’ Stirling Prize winning architecture practices. This declaration has now been supported by over 850 architecture practices in the UK, and the list is growing. In parallel, there have been declarations from the wider Construction Industry – from Building Service Engineers, Structural Engineers, to Project Managers, also pledging to similar declarations.<\/p>\r\n\r\n\r\n\r\n<p>Our industry is ready to make significant changes to the way we design, build and operate buildings.<\/p>\r\n\r\n\r\n\r\n<p>dRMM broadly supports both <a href=\"https:\/\/www.leti.london\/part-l\">LETI <\/a>and <a href=\"https:\/\/www.architectscan.org\/part-l\">ACAN<\/a>’s views on the Part L consultation.<\/p>\r\n\r\n\r\n\r\n<p>dRMM’s main recommendations are:<\/p>\r\n\r\n\r\n\r\n<p><strong>1. Local authorities should retain control.<\/strong><\/p>\r\n\r\n\r\n\r\n<p>To date 265 out of 408 councils, or 65% of councils have so far declared a Climate Emergency, and are setting their own stretching planning targets, including for energy efficiency. Local Authorities are well-placed to understand local issues, capabilities and needs, and we believe they should have the ability as such to implement energy efficiency targets to meet their own net-zero carbon plans.<\/p>\r\n\r\n\r\n\r\n<p>dRMM recommends that Building Regulations form a national baseline, or minimum standard, and that Local Authorities should retain their ability to encourage stretching targets in order to meet their local net-zero targets<\/p>\r\n\r\n\r\n\r\n<p><strong>2. Fabric Energy Efficiency Standards should be retained, and improved<\/strong><\/p>\r\n\r\n\r\n\r\n<p>Homes are a major contributor to UK CO2e emissions, with 22% of UK emissions arising from homes, with 15% of UK emissions resulting from just heating and hot water for homes (refer to LETI Climate Emergency Design Guide, 2020 p. 14)<\/p>\r\n\r\n\r\n\r\n<p>We need to better insulate our homes across the board, to ensure we work to reduce overall energy demand, and the resulting CO2e emissions. dRMM believe that the Future Homes Standard 2020 does not encourage well-insulated building fabrics, due to the omission of the Fabric Energy Efficiency Standard (FEES).<\/p>\r\n\r\n\r\n\r\n<p>The proposed changes to Part L &amp; F have the potential for building fabrics to become worse, not better.<\/p>\r\n\r\n\r\n\r\n<p>dRMM are keen to emphasise that poor building fabrics have no place in the current Climate Emergency, and will likely need to be replaced in costly retrofits in the near future, particularly as temperatures increase in the UK.<\/p>\r\n\r\n\r\n\r\n<p><strong>3. We need Building Regulations to be developed in a holistic, Whole Life carbon way<\/strong><\/p>\r\n\r\n\r\n\r\n<p>The Part L and F proposed changes do not consider operational carbon from a whole life carbon perspective. Given that we are in a Climate Emergency, with only 10 years to limit global warming to less than 1.5oC, we as architects are mindful of the carbon associated with construction, maintenance and demolition of our buildings – Embodied Carbon. As operational carbon efficiencies improve, whether through fabric efficiencies or the decarbonisation of the grid, the proportional impact of embodied carbon increases.<\/p>\r\n\r\n\r\n\r\n<p>We find that this can represent around half of a building’s Whole Life Carbon Impact, of which a large proportion can arise specifically from building services equipment (refer to LETI’s Embodied Carbon Primer). This is pertinent particularly in the present Climate Emergency, as embodied carbon emissions arise now, whereas operational carbon emissions accrue over a building’s life time.<\/p>\r\n\r\n\r\n\r\n<p>The Building Regulations need to consider Whole Life and Embodied Carbon, as otherwise there is a risk that the targets set may have unintended consequences over a building’s whole life’s carbon impact. We need to design holistically to meet Whole Life Net Zero, and the Building Regulations need to help us to get there.<\/p>\r\n\r\n\r\n\r\n<p>We will be publishing our complete response shortly.<\/p>\r\n\r\n\r\n\r\n<p>Don’t forget to submit your own response before the end of the day on Friday 7 February.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>At dRMM, we have issued our response to the Part L &amp; F consultation because we believe that the government’s proposals are a step backwards from the direction in which we urgently must head to meet our climate change targets. In 2019, dRMM declared a Climate and Biodiversity Emergency, alongside all 17 Royal Institute of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[19],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/posts\/7448"}],"collection":[{"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/comments?post=7448"}],"version-history":[{"count":1,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/posts\/7448\/revisions"}],"predecessor-version":[{"id":7832,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/posts\/7448\/revisions\/7832"}],"wp:attachment":[{"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/media?parent=7448"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/categories?post=7448"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/drmmstudio.com\/wp-json\/wp\/v2\/tags?post=7448"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}